app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("title", "instructions", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Pastel de Choclo"], ["instructions", "1) Choclo\r\n2) Carne molida\r\n3) etc"], ["created_at", "2022-06-28 18:17:21.186090"], ["updated_at", "2022-06-28 18:17:21.186090"]]

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "instructions" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["instructions", "1) Haga tal cosa\r\n2) Ocupe carne de soya"], ["updated_at", "2022-06-28 18:17:56.783059"], ["id", 2]]